ZetaWeb.Exchange/src/Catalogs/зс_веб_НастройкиОбмена/зс_веб_НастройкиОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зс_веб_НастройкиОбмена</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОсновнойВыгрузкаИзменений</name>
      <description>Основной (выгрузка изменений)</description>
    </items>
  </predefined>
  <attributes>
    <name>РежимОбменаПолный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьZIP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыДанных</name>
    <comment>Имя БД на сервере &quot;1С предприятие&quot; или имя каталога для файловой БД.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеорганизацияФизическихСрезов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПорцииДляВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОбменаТестовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьВЛогТолькоОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьНекорректныеСимволы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ZetaWeb.Exchange/src/InformationRegisters/зс_веб_ЗначенияНастроекОбмена/зс_веб_ЗначенияНастроекОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зс_веб_ЗначенияНастроекОбмена</name>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>CatalogRef.зс_веб_НастройкиОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектОбмена</name>
    <type>
      <types>CatalogRef.зс_веб_ОбъектыОбмена</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ZetaWeb.Exchange/src/Catalogs/зс_веб_ОбъектыОбмена/зс_веб_ОбъектыОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зс_веб_ОбъектыОбмена</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипОбъекта</name>
    <comment>Например, Спр, Док, ТЧ и т.д.</comment>
    <type>
      <types>EnumRef.ЗетаWEBТипыОбъектовКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительскийОбъектОбмена</name>
    <type>
      <types>CatalogRef.зс_веб_ОбъектыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьОбъектССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПланаОбмена</name>
    <type>
      <types>EnumRef.зс_веб_ИменаПлановОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <comment>Истина - объект конфигурации, ложь - объект CMS</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКонфигурации</name>
    <comment>Нужен для перехода на новую систему обмена</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбмене</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаПоддержке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ZetaWeb.Exchange/src/Catalogs/зс_веб_НастройкиОбмена/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбменССайтом(Команда)
	
	ВыполнитьОбменПоТекущимДанным();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуНаСайт(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		зс_веб_ОбменДаннымиВыгрузка.ВыгрузитьДанныеПоНастройкеОбмена(ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуССайта(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		зс_веб_ОбменДаннымиЗагрузка.ЗагрузитьДанныеПоНастройкеОбмена(ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереносНастроекОбмена(Команда)
	
	ПеренестиНастройкиОбмена();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВыполнитьОбменПоТекущимДанным()

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		зс_веб_ОбменДаннымиОбщий.ВыполнитьОбмен(ТекущиеДанные.Ссылка);
		
	КонецЕсли;

КонецПроцедуры // ВыполнитьОбменПоТекущимДанным()

#Область ПереносНастроекОбменаИзПервойВерсииВоВторую

&НаСервереБезКонтекста
Функция ПолучитьНастройкуОбмена(ИсходнаяНастройка)
	
	Если НЕ ЗначениеЗаполнено(ИсходнаяНастройка) Тогда
		
		Возврат Справочники.зс_веб_НастройкиОбмена.ПустаяСсылка();
		
	КонецЕсли;
	
	НаименованиеНастройки = ИсходнаяНастройка.Наименование;
	
	Настройка = Справочники.зс_веб_НастройкиОбмена.НайтиПоНаименованию(НаименованиеНастройки, Истина);
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		
		Возврат Настройка;
		
	Иначе

		НоваяНастройка = Справочники.зс_веб_НастройкиОбмена.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(НоваяНастройка, ИсходнаяНастройка, , "Код, Владелец");
		
		НоваяНастройка.Записать();
		
		Возврат НоваяНастройка.Ссылка;
		
	КонецЕсли;

КонецФункции // ПолучитьНастройкуПолногоОбмена()

&НаСервереБезКонтекста
Процедура ПеренестиНастройкиОбмена()
	
	НоваяНастройка = Справочники.зс_веб_НастройкиОбмена.ОсновнойВыгрузкаИзменений.ПолучитьОбъект();
	ИсходнаяНастройка = Справочники.ЗетаWEBНастройкиОбмена.ОсновнойВвыгрузкаИзменений;
	
	ЗаполнитьЗначенияСвойств(НоваяНастройка, ИсходнаяНастройка, , "Код, Владелец");
	
	НоваяНастройка.Записать();	
	
	НаборЗаписейСтарыеЗапросы = РегистрыСведений.ЗетаWEBЗначенияНастроекОбмена.СоздатьНаборЗаписей();
	НаборЗаписейСтарыеЗапросы.Прочитать();
	
	ТаблицаЗаписей = НаборЗаписейСтарыеЗапросы.Выгрузить();
	ТаблицаЗаписей.Колонки.Добавить("ОбъектОбмена");
	ТаблицаЗаписей.Колонки.Настройка.Имя = "СтараяНастройка";
	ТаблицаЗаписей.Колонки.Добавить("Настройка");
	
	МассивСтрокКУдалению = Новый Массив;
	
	Для каждого СтрокаЗаписи Из ТаблицаЗаписей Цикл
	
		СтрокаЗаписи.ОбъектОбмена = Справочники.зс_веб_ОбъектыОбмена.НайтиПоРеквизиту("ИдентификаторОбъектаКонфигурации", СтрокаЗаписи.ОбъектКонфигурации.УникальныйИдентификатор());
		
		Если СтрокаЗаписи.СтараяНастройка = Справочники.ЗетаWEBНастройкиОбмена.ОсновнойВвыгрузкаИзменений Тогда 
		
			СтрокаЗаписи.Настройка = Справочники.зс_веб_НастройкиОбмена.ОсновнойВыгрузкаИзменений;
			
		Иначе
			
			СтрокаЗаписи.Настройка = ПолучитьНастройкуОбмена(СтрокаЗаписи.СтараяНастройка);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаЗаписи.Настройка) ИЛИ НЕ ЗначениеЗаполнено(СтрокаЗаписи.ОбъектОбмена) ИЛИ СтрокаЗаписи.ОбъектОбмена.ЭтоГруппа Тогда
			
			МассивСтрокКУдалению.Добавить(СтрокаЗаписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаЗаписи Из МассивСтрокКУдалению Цикл
	
		ТаблицаЗаписей.Удалить(СтрокаЗаписи);	
	
	КонецЦикла;
	
	НаборЗаписейНовыеЗапросы = РегистрыСведений.зс_веб_ЗначенияНастроекОбмена.СоздатьНаборЗаписей();
	
	НаборЗаписейНовыеЗапросы.Загрузить(ТаблицаЗаписей);
	
	НаборЗаписейНовыеЗапросы.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
